# Navbar
navbar.home=Inicio
navbar.about=Acerca de nosotros
navbar.register=Registrarse
navbar.login=INICIAR SESI\u00D3N
language.spanish=Español
language.english=Inglés
language.italian=Italiano

# Footer
footer.about.description=Cuidamos con amor y profesionalismo a tus mascotas, porque ellos son parte de nuestra familia tambi\u00E9n.
footer.contact.title=Informaci\u00F3n de Contacto
footer.contact.address=Calle Principal #123, Neiva, Huila
footer.contact.phone=(+57) 321-456-7890
footer.contact.email=info@vetplanet.com
footer.contact.hours=Lunes a Domingo: 8:00 AM - 5:00 PM
footer.nav.title=Menu de navegaci\u00F3n
footer.nav.services=Servicios
footer.nav.login=Iniciar sesi\u00F3n
footer.copyright=\u00A9 2025 VetPlanet. Todos los derechos reservados | Dise\u00F1ado para el bienestar animal

# Home
home.title=Inicio VetPlanet
home.banner.title=En VetPlanet cuidamos de tu mascota con amor y profesionalismo
home.banner.subtitle=Explora nuestros servicios y agenda tu cita en l\u00EDnea de forma r\u00E1pida y gratuita.
home.banner.button=Agendar Cita
home.services.title=Nuestros Servicios Veterinarios
home.services.description=En VetPlanet, nos enorgullecemos de ofrecer una completa variedad de servicios veterinarios para cubrir todas las necesidades de tu mascota.
home.service.dental.title=Odontolog\u00EDa
home.service.dental.description=Se dedica al cuidado dental de mascotas, asegurando una salud bucal \u00F3ptima para mejorar su calidad de vida. Su enfoque es prevenir y tratar enfermedades dentales en perros y gatos con t\u00E9cnicas avanzadas y un trato cercano.
home.service.dermatology.title=Dermatolog\u00EDa
home.service.dermatology.description=Se enfoca en el diagn\u00F3stico y tratamiento de diversas afecciones en la piel. Su objetivo es proporcionar soluciones personalizadas para problemas como alergias, infecciones y trastornos cut\u00E1neos, siempre buscando mejorar la calidad de vida de cada mascota.
home.service.general.title=Consulta General
home.service.general.description=Incluye una evaluaci\u00F3n completa de la salud de las mascotas, chequeos f\u00EDsicos detallados y asesoramiento sobre nutrici\u00F3n y prevenci\u00F3n de enfermedades. Adem\u00E1s, se ofrece la administraci\u00F3n de vacunas para proteger a tu mascota de enfermedades comunes.
home.service.grooming.title=Est\u00E9tica Animal
home.service.grooming.description=Ofrecemos cortes de pelo personalizados, ba\u00F1os especializados que incluyen tratamientos para piel y pelaje, y deslanado. Tambi\u00E9n brindamos terapias de relajaci\u00F3n para reducir el estr\u00E9s, asegurando que tu mascota disfrute de una experiencia placentera y saludable.
home.professionals.title=Conoce a Nuestros Profesionales
home.professional.dentist.name=Alejandro Torres G\u00F3mez
home.professional.dentist.profession=Odont\u00F3logo Veterinario
home.professional.dentist.description=Se dedica al cuidado dental de mascotas, asegurando una salud bucal \u00F3ptima para mejorar su calidad de vida. Su enfoque es prevenir y tratar enfermedades dentales con t\u00E9cnicas avanzadas y un trato cercano.
home.professional.dermatologist.name=Carolina Garc\u00EDa L\u00F3pez
home.professional.dermatologist.profession=Dermat\u00F3loga Veterinaria
home.professional.dermatologist.description=Garantiza el bienestar de las mascotas mediante el diagn\u00F3stico y tratamiento de afecciones cut\u00E1neas. Su enfoque es prevenir y tratar problemas como alergias, infecciones y trastornos de la piel con t\u00E9cnicas avanzadas.
home.professional.vet.name=Gabriel Ortega P\u00E9rez
home.professional.vet.profession=M\u00E9dico Veterinario
home.professional.vet.description=Asegura la salud de las mascotas con servicios especializados para su cuidado integral. Su enfoque es prevenir y tratar enfermedades mediante ex\u00E1menes de rutina, diagn\u00F3stico especializado y controles de salud preventivos.
home.professional.groomer.name=Valeria Villalobos
home.professional.groomer.profession=Especialista en Est\u00E9tica Animal
home.professional.groomer.description=Se especializa en el cuidado est\u00E9tico y de bienestar de las mascotas, proporcionando una gama de servicios que buscan realzar la belleza y salud de las mascotas. Su trabajo incluye peluquer\u00EDa, ba\u00F1os terap\u00E9uticos y cortes de pelo.
home.carousel.previous=Anterior
home.carousel.next=Siguiente

# About Us Page
about.title=Acerca de Nosotros
about.banner.title=Acerca de Nosotros
about.mission.title=Nuestra Misi\u00F3n
about.mission.paragraph1=En VetPlanet, nuestra misi\u00F3n es brindar atenci\u00F3n integral y especializada a las mascotas, asegurando su bienestar y calidad de vida a trav\u00E9s de servicios veterinarios de excelencia, tecnolog\u00EDa avanzada y un equipo comprometido con la salud animal.
about.mission.paragraph2=Nos esforzamos por crear un v\u00EDnculo de confianza con los propietarios, promoviendo la educaci\u00F3n sobre el cuidado responsable y ofreciendo soluciones personalizadas para cada necesidad, siempre con empat\u00EDa y profesionalismo.
about.vision.title=Nuestra Visi\u00F3n
about.vision.paragraph1=En VetPlanet, nuestra visi\u00F3n es ser el referente l\u00EDder en cuidado veterinario, ofreciendo innovaci\u00F3n y excelencia para garantizar el bienestar de las mascotas y la tranquilidad de sus due\u00F1os.
about.vision.paragraph2=Aspiramos a construir una comunidad consciente del cuidado animal, promoviendo valores de respeto, amor y responsabilidad hacia las mascotas y su entorno.
about.pillars.title=Nuestros Pilares
about.pillars.intro=Estos son los valores fundamentales que gu\u00EDan nuestras acciones y decisiones:
about.pillars.innovation.title=Innovaci\u00F3n Constante
about.pillars.innovation.description=Buscamos continuamente nuevas formas de mejorar y evolucionar, adapt\u00E1ndonos r\u00E1pidamente a un entorno cambiante.
about.pillars.excellence.title=Compromiso con la Excelencia
about.pillars.excellence.description=Nos esforzamos por alcanzar los m\u00E1s altos est\u00E1ndares en todo lo que hacemos, sin comprometer la calidad.
about.pillars.responsibility.title=Responsabilidad Social
about.pillars.responsibility.description=Nos comprometemos a operar de manera \u00E9tica y sostenible, contribuyendo positivamente a nuestras comunidades y al medio ambiente.
about.faq.title=Preguntas Frecuentes
about.faq.q1=\u00BFC\u00F3mo puedo agendar una cita para mi mascota?
about.faq.a1=Para agendar una cita, primero debes estar registrado e iniciar sesi\u00F3n en la plataforma. Luego, podr\u00E1s acceder a tu panel de usuario, registrar a tu mascota si a\u00FAn no lo has hecho, y seleccionar el servicio que necesitas. El sistema te mostrar\u00E1 las fechas y horarios disponibles a partir del d\u00EDa siguiente.
about.faq.q2=\u00BFPuedo reservar una cita para el mismo d\u00EDa?
about.faq.a2=No. Por funcionamiento del sistema, las citas deben agendarse con al menos un d\u00EDa de anticipaci\u00F3n. Es decir, hoy solo podr\u00E1s ver y reservar horarios disponibles para ma\u00F1ana o d\u00EDas posteriores.
about.faq.q3=\u00BFPuedo registrar m\u00E1s de una mascota en mi cuenta?
about.faq.a3=S\u00ED, nuestra plataforma permite que cada usuario registre m\u00FAltiples mascotas desde su panel personal. Podr\u00E1s ingresar los datos de cada una (como nombre, especie, raza, edad, etc.) y gestionar sus citas de forma individual. Esto es ideal si tienes varios animales en casa, ya que puedes llevar un seguimiento separado del historial de citas y servicios utilizados.
about.faq.q4=\u00BFQu\u00E9 pasa si el servicio que necesito no est\u00E1 disponible?
about.faq.a4=Si no hay disponibilidad para el servicio que deseas, el sistema te lo indicar\u00E1 directamente en el panel de citas. Te recomendamos revisar nuevamente m\u00E1s tarde o elegir otra fecha, ya que los espacios se actualizan constantemente seg\u00FAn la demanda.

# Contenido del Formulario de Inicio de Sesion
login.title=Inicio de sesi\u00F3n
login.email=Correo Electr\u00F3nico
login.password=Contrase\u00F1a
login.button=Iniciar Sesi\u00F3n
login.returnButton=Regresar al Inicio
login.questionSpan=\u00BFNo tienes una cuenta?
login.registerLink=Reg\u00EDstrate ahora

# Contenido del Formulario de Registro
registration.title=Registro
registration.slogan=Facilidad y confianza al agendar su pr\u00F3xima cita
registration.description=\u00DAnete a nuestro portal y agenda citas de manera r\u00E1pida y sencilla. Gestiona la atenci\u00F3n presencial de tu mascota con solo unos clics. \u00A1Porque su bienestar comienza con una buena organizaci\u00F3n!
registration.formTitle=Reg\u00EDstrate y agenda la mejor atenci\u00F3n para tu mascota
registration.name=Nombre
registration.namePlaceholder=Escribe tu nombre
registration.lastName=Apellido
registration.lastNamePlaceholder=Escribe tu apellido
registration.email=Correo Electr\u00F3nico
registration.emailPlaceholder=tu@email.com
registration.phone=Tel\u00E9fono
registration.phonePlaceholder=3202692173
registration.password=Contrase\u00F1a
registration.passwordPlaceholder=Contrase\u00F1a segura
registration.button=Registrarse
registration.returnButton=Regresar al Inicio
registration.questionSpan=\u00BFYa tienes una cuenta?
registration.loginLink=Inicia sesi\u00F3n ahora
# Mensajes de Validaciones de Registro de Usuario
error.name.invalid=El nombre es obligatorio, debe tener entre 3 y 50 letras
error.lastname.invalid=El apellido es obligatorio, debe tener entre 3 y 50 letras
error.email.invalid=El email es obligatorio, ingrese un email v\u00E1lido
error.phone.invalid=El tel\u00E9fono es obligatorio, debe comenzar por 3 y contener exactamente 10 d\u00EDgitos, debe ser un n\u00FAmero de tel\u00E9fono colombiano v\u00E1lido
error.password.invalid=La contrase\u00F1a debe tener al menos 8 caracteres, incluyendo una may\u00FAscula, una min\u00FAscula, un n\u00FAmero y puede contener los caracteres especiales @, - o _
# Mensajes de error-excepciones dentro del formulario de registro
error.user.notFound=No se encontró ningún usuario con el email: {0}
error.email.existing=El correo electrónico ya está registrado
error.phone.existing=El número de teléfono ya está registrado

# ========= Paginas privada ========== #
# Sidebaruser
sidebar.notification=Notificaciones
sidebar.favorites=Favoritos
sidebar.saved=Guardados
sidebar.logout=Cerrar Sesi\u00F3n

# Error 403 - Acceso Denegado
error403.pageTitle=Acceso Denegado - VetPlanet
error403.title=Acceso Denegado
error403.message=Lo sentimos, no tienes permiso para acceder a esta p\u00E1gina.
error403.backButton=Regresar

# ========= Paginas privada USER ========== #

# Lista de Mascotas
petsList.title=Mis Mascotas - Sistema Veterinario
petsList.heading=Mis Mascotas
petsList.subheading=Administra la informaci\u00F3n de tus mascotas
petsList.addButton=Agregar Mascota
petsList.noPets=No tienes mascotas registradas
petsList.noPetsMessage=Registra tu primera mascota haciendo clic en el bot\u00F3n "Agregar Mascota"
petsList.viewButton=Ver
petsList.editButton=Editar
petsList.deleteButton=Eliminar
petsList.deleteConfirm=\u00BFEst\u00E1s seguro de eliminar esta mascota?

# Detalles de Mascota
petDetails.title=Detalles de Mascota - Sistema Veterinario
petDetails.heading=Detalles de la Mascota
petDetails.subheading=Informaci\u00F3n completa y historial de citas
petDetails.editButton=Editar Informaci\u00F3n
petDetails.scheduleButton=Agendar Cita
petDetails.generalInfo=Informaci\u00F3n General
petDetails.gender=Sexo
petDetails.birthDate=Fecha de nacimiento
petDetails.age=Edad aproximada
petDetails.years=a\u00F1os
petDetails.appointmentHistory=Historial de Citas
petDetails.noAppointments=Esta mascota no tiene citas registradas
petDetails.scheduleFirstButton=Agendar Primera Cita
petDetails.table.date=Fecha
petDetails.table.service=Servicio
petDetails.table.status=Estado
petDetails.table.actions=Acciones
petDetails.editAppointment=Editar cita
petDetails.cancelAppointment=Cancelar cita
petDetails.cancelConfirm=\u00BFEst\u00E1s seguro de cancelar esta cita?

# Formulario de Mascota
petForm.title=Formulario de Mascota - Sistema Veterinario
petForm.heading=Registrar nueva mascota
petForm.subheading=Ingrese los datos de su mascota
petForm.name=Nombre de la mascota
petForm.species=Especie
petForm.selectSpecies=-- Seleccione especie --
petForm.dog=Perro
petForm.cat=Gato
petForm.bird=Ave
petForm.rabbit=Conejo
petForm.rodent=Roedor
petForm.reptile=Reptil
petForm.other=Otro
petForm.breed=Raza
petForm.birthDate=Fecha de nacimiento
petForm.dateFormat=DD/MM/AAAA
petForm.invalidDate=Por favor seleccione una fecha de nacimiento v\u00E1lida
petForm.gender=Sexo
petForm.selectGender=-- Seleccione sexo --
petForm.male=Macho
petForm.female=Hembra
petForm.cancel=Cancelar
petForm.save=Guardar

# ========= Paginas privada ADMIN ========== #

# Admin - Lista de Usuarios
adminUsers.pageTitle=Gesti\u00F3n de Usuarios - Sistema Veterinario
adminUsers.title=Gesti\u00F3n de Usuarios
adminUsers.subtitle=Administre los usuarios del sistema
adminUsers.newUser=Nuevo Usuario
adminUsers.searchPlaceholder=Buscar por nombre o email
adminUsers.searchButton=Buscar
adminUsers.table.id=ID
adminUsers.table.name=Nombre
adminUsers.table.lastName=Apellido
adminUsers.table.email=Email
adminUsers.table.phone=Tel\u00E9fono
adminUsers.table.roles=Roles
adminUsers.table.actions=Acciones
adminUsers.noUsers=No hay usuarios registrados
adminUsers.editButton=Editar

# Admin - Formulario de Usuario
adminBack=Volver
adminPersonalData=Datos Personales
adminSecurity=Seguridad y Permisos
adminName=Nombre
adminLastName=Apellido
adminEmail=Email
adminPhone=Tel\u00E9fono
adminRoles=Roles
adminCancel=Cancelar
adminNameHelp=El nombre debe tener entre 3 y 50 caracteres y solo contener letras.
adminLastNameHelp=El apellido debe tener entre 3 y 50 caracteres y solo contener letras.
adminEmailHelp=Ingrese un email v\u00E1lido.
adminPhoneHelp=El tel\u00E9fono debe comenzar con 3 y tener 10 d\u00EDgitos.
adminPasswordHelp=La contrase\u00F1a debe tener al menos 8 caracteres, incluyendo may\u00FAsculas, min\u00FAsculas y n\u00FAmeros.
adminRolesHelp=Seleccione al menos un rol para el usuario.